{
  "entries": [
    {
      "id": 1,
      "date": "5/22/2020",
      "concepts": "First Week Completed",
      "mood": "Accomplished",
      "entry": "We just finished our first week of class. I was nervous at first about doing it all remotely, but I'm kind of loving it. I'm never late, there's no traffic, and I can fold laundry/workout/make a sandwich during the lunch hour. Working from home is godly."
    },
    {
      "id": 2,
      "date": "5/28/2020",
      "concepts": "Group Project, Git",
      "mood": "Happy",
      "entry": "Today my group presented the website we were working on. My group was awesome. I learned a lot about Git with this project. I noticed that I'm referencing my notes less and less. I need to practice public speaking. Even on a computer it was pretty challenging for me. Thankfully the programming world seems to be pretty forgiving about awkward personalities."
    },
    {
      "id": 3,
      "date": "6/1/2020",
      "concepts": "Flexbox, Modular Design",
      "mood": "Happy",
      "entry": "Today we designed a basic site using Flexbox and modular design."
    },
    {
      "id": 4,
      "date": "6/2/2020",
      "concepts": "Automating Site Content with JavaScript",
      "mood": "Excited",
      "entry": "Today we learned the basics of how to automate site content generation with Javascript instead of hardcoding it in HTML. I am excited to learn more about this, I can see how this could be applied to many realworld applications. Class seems to be getting harder! Need to brush up on loops in Javascript."
    },
    {
      "date": "6/5/2020",
      "concepts": "Third Week Completed: JSON, Generating content from javascript, Postman",
      "mood": "Burned out",
      "entry": "This week we learned a lot! I got the gist of everything at least. I'm not sure how the Javascript functions for pulling data from JSON works. I can get it working though. Need to read up on it. Brain hurt. Next week we start another group project. I'm excited to get to know some of my classmates more.",
      "id": 5
    }
  ]
}